# 1)შექმენით ფუნქცია რომელსაც გადაეცემა სია სადაც მოთავსებული იქნება მხოლოდ რიცხვები და 
# სტრინგ ტიპის მონაცეემები,თქვენი დავალებაა რომ ამ სიიდან ამოიღოთ ინტეჯერ ტიპის 
# მონაცემეები და დაამატოთ ახალ სიაში,და ასევე უნდა ამოიღო სიიდან სტრინგ ტიპის 
# მონაცემები და დაამატო ესეც სხვა ახალ სიაში,თქვენი დავალებაა რომ რიცხვებით სავსე 
# სია დაალაგოთ ზრდადიბის მიხედვით და სტრრინგების სია დაალაგოთ სიაში მოთავსებული 
# სიტყვების სიგრძის მიხედვით

def str_int(list):
    str_list=[]
    int_list=[]
    for i in list:
        if type(i) == str:
            str_list.append(i)
        elif type(i) == int:
            int_list.append(i)
    return sorted(int_list), sorted(str_list, key=len)
print(str_int([]))
