# 3)შექმენით ფუნქცია რომელსაც გადაეცემა ერთი მთლიანი წინადადება,თქვენი დავალებაა ამ წინადადებაში მყოფი სიტყვები ჩაამატოთ სიაში
# (გამოიყენეთ შესაბამისი ფუნქცია)და შემდეგ ეს სია დაუბრუნოთ ისევ ერთ მთლიან სტრინგად(წინადადებად) მაგრამ სტრინგად დაბრუნების დროს ეს სიტყვები 
# გამოყავით ერთმანეთისაგან @ ამ ნიშნით და ასევე ყველა სიტყვის პირველი ასო იყოს დიდი(CAPIRALIZE)


def return_name(list):
    final_list= list.split()
    finnal=[]
    for i in final_list:
        finnal.append(i.capitalize())
    return '@'.join(finnal)
print(return_name())