# 2)შექმენით ფუნქცია სადაც მოთავსებული გექნებათ რიცხვები,თქვენი დავალებაა გააარკვიოთ თ ეს რიცხვი არის ლუწი და ამავდროულად დგას 
# ლუწ ინდექსზე, მაშინ ეს რიცხვები დაამატე ახალ სიაში და იპოვეთ ამ ახალ სიაში მყოფი რიცხვების საშუალო არითმეტიკული

def nambers(nam):
    namber_len=0
    sum=0
    index=0
    for i in range(0, len(nam)):
        index += 1
        if nam[i] % 2 == 0 and  index % 2 == 0:
            sum += nam[i]
            namber_len += 1
    return sum // namber_len
print(nambers([1, 2, 3, 4, 5, 6, 7, 8, 9]))



