# 5)შექმენით ფუნქცია რომელსაც გადაეცემა სია,ამ სიაში მოთავსებული უნდა იყოს სხვადასხვა მონაცემთა ტიპები,შენი დავალებაა გაიგო თუ ამ 
# სიაში იმყოფება სტრინგი,მაშინ ეს სტრინგი ჩაამატე ახალ სიაში,შემდეგ ეს სია სადაც შენახული გექნებათ სტრინგები გადმოიყვანოთ ერთ
#  მთლიან სტრინგად და თითოეული ელემენტი ერთმანეთისგან დაშორებული იყოს # ნიშნით,შემდეგ დაითვალეთ,თუ რამდენი 
# # ეს ნიშანი გვხვდება ამმსტრინგში

def str_list(list):
    list_str=[]
    for i in list:
        if type(i) == str:
            list_str.append(i)
    txt='#'.join(list_str)
    caunt=0
    for i in txt:
        if i == '#':
            caunt += 1
    return caunt
print(str_list([]))