# 6)შექმენით ფუნქცია რომელსაც გადასცემთ რიცხვებით სავსე სიას,თქვენი დავალებაა შეამოწმოთ თუ ამ სიაში მყოფი რიცხვების საშუალო
#  არითმეტიკული მეტია 20ზე მაგ შემთხვევაში  0 დან მიღებული საშუალო არითმეტიკულამდე დაატრიალეთ ფორ ციკლი,შენი დავალებაა 
# გაიგო ამ დიაპაზონში ლუწი რიცხვების რაოდენობა და კენტი რიცხვების ჯამი,სხვა შემთხვევაში,დაითვალე 0 დან საშუალო მიღებულ საშუვალო 
# არითმეტიკულამდე და გამოიტანო თითეული რიცხვი

def aritmetikuli(nambers):
    sum=0
    caunt=0
    for i in nambers:
        sum += i
        caunt +=1
    sashvalo = sum / caunt
    luwi=0
    kenti=0
    if sashvalo > 20:
        for i in range(0, sashvalo):
            if i % 2 == 0:
                luwi += 1
            elif i % 2 != 0:
                kenti += i
    else:
        for j in range(0, sashvalo):
            print(j)
print(aritmetikuli([]))
