# 2)შექმენი ფუნქცია რომელსაც გადაეცემა სია,ამ სიაში უნდა იყოს მოთავსებული სახელები,თქვენი დავალებაა მიწვდეთ ამ სახელებს და შემდეგ
#  ამ სახელებში მყოფ ასოებს,თქვენი დავალებაა ახალ სიაში ჩაამატოთ მხოლოდ თანხმოვანია ასოები,შემდეგ ამ სიაში მყოფი ასოები დაალაგეთ
#  ანბანის მიხედვით(დაასორტირეთ)მოიძეთ ინფორმაცია თუ როგორ ხდება სორტირება და რომელი ფუნქცია გამოიყენება ამისათვის

def anbani(list):
    tanxmovani=[]
    for i in list:
        for j in i:
            if j not in 'aeiou':
                tanxmovani.append(j)
    return sorted(tanxmovani, )
print(anbani([]))