# 3)შექმენი ფუნქცია რომელსაც გადაეცემა სია,ამ სიაში უნდა გქონდეთ კიდევ სამი სია,და ამ სამ სიაში უნდა გქონდეთ სამ სამი ელემენტი,თქვენი
#  დავალებაა მიწვდეთ ამ სიაში მყოფ სიას,შემდეგ ამ სიებში მყოფ ელმენტებს და შემდეგ ამ ელემენტებშ მყოფ ასოებს,შემდეგ ახალ სიაში დაამატე
#  მხოლოდ ხმოვანი ასოები და დაასორტირე,დაალაგე ანბანის მიხედვით(არ არის სავალდებულო,შემდეგზე აგიხსნით მაგრამ ეცადეთ მოიძოთ,სორტირება)


def sorted_list(list):
    finall_list=[]
    for i in list:
        for j in i:
            for x in j:
                if x in 'aeiou':
                    finall_list.append(x)
    return sorted(finall_list)
print(sorted_list([[],[],[]]))
