# 5)შექმენი ფუნქცია რომელსაც გადაეცემა ერთი მთლიანი დიდის ტრინგი,ამ სტრინგშ სიტყვები დააშორე % ამ ნიშნით,შენი დავლებაა ეს 
# სტრინგი აქციო სიად,შემდეგ შეამოწმო თუ ამ სიაში მყოფი ელემენტი დგას ლუწ ინდექსზე ჩაამატე ახალ სიაში,შემდეგ თქვენი დავალება
#  იქნება რომ ეს სია გადაიყვანოთ ისევ სტრინგში და ეს სიტყვები გამოყო ერთმანეთსგან სფეისებით


def str_list(list):
    user_str=list.split()
    finall_str_list = "%".join(user_str)
    final_list=[]

    for i in range(0, len(finall_str_list), 2):
        final_list.append(final_list[i])
    return ' '.join(final_list)
print(str_list([]))
