// // 1)შექმენი რიცხვებით სავსე სია,შენი დავალებაა იპოვო მხოლოდ ლუწი რიცხვების ჯამი
// let lst = [5, 6, 1, 24, 55, 23, 9, 12]
// let luwi = 0
// for (let i = 0; i< lst.length; i++){
//     if (lst[i] % 2 === 0){
//         luwi += lst[i]
//     }
// }

// // 2)შექმენი რიცხვებით სავსე სია,შენი დავალებაა იპოვო მხოლოდ კენტი რიცხვების ჯამი
// let lst = [5, 6, 1, 24, 55, 23, 9, 12]
// let kenti = 0
// for (let i = 0; i < lst.length; i++){
//     if (lst[i] % 2 != 0){
//         kenti += lst[i]
//     }
// }


// // 3)შექმენი სია სახელებით,შენი დავალებაა იპოვო სიაში მყოფი ელემენტების სიგრძეების ჯამი
// let names = ['nika', 'guka', 'saba', 'giorgi']
// let jami = 0
// for (let i = 0; i < names.length; i++){
//     jami += names[i].length
// }


// // 4)შენი დავალებაა დაითვალო 1 დან 20 მდე და ყველა ლუწი რიცხვი ჩაამატო ახალ სიაში
// let jami = 0
// let lst = []
// for (let i = 0; i < 20; i++){
//     if (i % 2 === 0){
//         jami += 1
//         lst.push(i)
//     }
// }


// // 6)შექმენი სტრინგების სია,ასევე შექმენი მეორე რიცხვების სია,, გააერთიანე ეს ორი სია 
// // ერთმანეთში და ამ გაერთიანებული სიის ყველა ელემენტი გამოიტანე ცალ ცალკე
// let names = ['nika', 'guka', 'saba', 'giorgi']
// let lst = [5, 6, 1, 24, 55, 23, 9, 12]
// let jami = names.concat(lst)

// for (let i = 0; i < jami.length; i++){
//     console.log(jami[i])
// }

// // 7)შექმენი სია სადაც შეიყვან რიცხვებს,შენი დავალებაა იპოვო სიაში მყოფი რიცცვების კუბების ჯამი
// let lst = [5, 6, 24]
// let jami = 0
// for (let i = 0; i < lst.length; i++){
//     jami += lst[i]**3
// }


