// // // 1)შექმენი ცვლადი რომელშც შეინახავ ნებისმიერ ათწილად რიცხვს
// // // შენი დავალებაა:
// // let number = 15.5
// // // დაამრგვალო ეს ათწილადი უახლახლოეს მთელ რიცხვამდე
// // console.log(Math.round(number))
// // // დაამრგვალო ეს ათწილადი ზემოთ მყოფ მთელამდე
// // console.log(Math.ceil(number))
// // // დაამრგვალო ეს ათწილად ქვემოთ მყოფ მთელამდე
// // console.log(Math.floor(number))
// // // და გამოიტანო მთელი ამ ათწილადი რიცხვისა
// // console.log(Math.trunc(number))
// // // ყველაფერი გამოიტანეთ კონსოლში'


// // 1)შექმენით ცვლადი და შეინახეთ ათწილადი რიცხვი
// // შენი დავალებაა გაიგო უარყოფითა დადებითი თუ 0 გადაცემული რიცხვი .sign()
// let number = 15.5

// if(Math.sign(number) === -1){
//     console.log('uaryofitia')
// }else if (Math.sign(number) === 1){
//     console.log('dadebitia')
// }else{
//     console.log('0is tolia')
// }


// // 2)აიყვანე რიცხვი 3 რიცხვი 5 ის ხარისხში
// console.log(Math.pow(3 , 5))

// // 3)ამოიღე ფესვი 81 დან და დაბეჭდე შედეგი
// console.log(Math.sqrt(81))


// // 4)გადააქციე  უარყოფითი რიცხვი დადებით რიცხვად
// console.log(Math.abs(-5))


// // 5)იპოვე რაიმე 5 რიცხვიდან იმცირესი

// console.log(Math.min(15, 45, 1, 4, 8))


// // 6)იპოვე რაიმე 5 რიცხვიდან უდიდესი
// console.log(Math.max(15, 45, 1, 4, 8))


// // 7)დააგენერირე რაიმე რენდომ რიცხვი

// console.log(Math.random(5))


