// // 1)შექმენი Function Declaration, რომელიც მასივში ამატებს ახალ ელემენტს push()-ის გამოყენებით.
// // პარამეტრები:
// // array (სადაც ემატება ელემენტი)
// // value (რაც ემატება)
// // ფუნქცია უნდა გამოიძახო და გადასცე შესაბამისი არგუმენტები 

// function Declaration(arr, value){
//     arr.push(value)
//     return arr
// }
// console.log(Declaration([1, 2, 3, 4], 5))



// // 2)შექმენი Arrow Function, რომელიც მასივიდან ბოლო ელემენტს შლის pop()-ით და აბრუნებს მიღებულ მასივს.
// // გამოიძახე ფუნქცია.
// const lst =  (arr) => {
//     arr.pop()
//     return arr
// }




// // 3)შექმენი Function Expression, რომელიც მასივიდან პირველ ელემენტს შლის shift()-ის გამოყენებით.
// // გამოიძახე ფუნქცია.
// let lst = function (arr){
//     arr.shift()
//     return arr
// }





// // 4)შექმენი Arrow Function, რომელიც მასივის დასაწყისში ამატებს ელემენტს unshift()-ით.
// // ფუნქციას გადაეცეს:
// // array
// // value
// // შემდეგ გამოიძახე.

// const lst = (arr, value) => {
//     arr.unshift(value)
//     return arr
// }



// // 5)შექმენი Function Declaration, რომელიც პარამეტრად მიიღებს მასივს და დააბრუნებს მის სიგრძეს (length).
// // გამოიძახე ფუნქცია.

// function lst(arr){
//     return arr.lenght
// }


// 6)შექმენი Function Expression, რომელიც შეამოწმებს გადაცემული მნიშვნელობა მასივია თუ არა Array.isArray()-ის გამოყენებით.
// გამოიძახე ფუნქცია:
// მასივზე
// სტრინგზე
// რიცხვზე



// 7)შექმენი Function Expression.
// ფუნქციამ:
// დაამატოს ახალი ელემენტი push()-ით;
// დაბეჭდოს ახალი მასივი;
// დაბეჭდოს მასივის სიგრძე (length).



// 8)შექმენი Arrow Function.
// ფუნქციამ:
// ჯერ დაამატოს ელემენტი unshift()-ით;
// შემდეგ წაშალოს პირველი ელემენტი shift()-ით;
// დაბეჭდოს საბოლოო მასივი.



// 9)შექმენი Function Expression, რომელიც:
// იღებს მასივს;
// ამატებს ერთ ელემენტს push()-ით;
// ამატებს ერთ ელემენტს unshift()-ით;
// შლის ბოლო ელემენტს pop()-ით;
// შლის პირველ ელემენტს shift()-ით;
// ბოლოს ბეჭდავს:
// საბოლოო მასივს;
// მის length-ს;
// Array.isArray()-ის შედეგს.
// გამოიძახე ფუნქცია.