// // 1)შექმენი სია:
// let fruits = ["Apple", "Banana", "Orange", "Kiwi", "Mango"]
// // დაბეჭდე:
// // // პირველი ელემენტი
// // ბოლო ელემენტი
// // მესამე ელემენტი
// console.log(fruits[1])
// console.log(fruits[fruits.length -1 ])
// console.log(fruits[3]);


// 2)მოცემულია:
// let numbers = [12, 45, 67, 89, 23];
// // დაბეჭდე მეორე და მეოთხე ელემენტები.
// console.log(numbers[2])
// console.log(numbers[4])

// 3)მოცემულია:
// let colors = ["Red", "Blue", "Green"];
// // შეცვალე:
// // "Blue" → "Yellow"
// // "Green" → "Black"
// // შემდეგ დაბეჭდე მთელი სია.
// colors[1] = 'yellow'
// colors[2] = 'black'
// console.log(colors)


// 4)მოცემულია:
// let ages = [12, 15, 18, 21];
// პირველი ელემენტი შეცვალე 10-ით, ბოლო კი 30-ით.

// 5)მოცემულია:
// let cities = ["Tbilisi", "Batumi", "Kutaisi", "Rustavi"];
// დაბეჭდე მესამე ქალაქი.
// შემდეგ შეცვალე "Kutaisi" → "Zugdidi".
// დაბეჭდე განახლებული სია.

// 6)მოცემულია:
// let animals = ["Cat", "Dog", "Lion", "Tiger"];
// დაბეჭდე ბოლო ელემენტი.
// შეცვალე პირველი "Elephant"-ით.
// დაბეჭდე მთელი სია.

// 7)შექმენი 5 სახელის სია.
// დაბეჭდე მეორე სახელი.
// შეცვალე ბოლო სახელი "Nika"-ით.
// დაბეჭდე შედეგი.

// 8)მოცემულია:
// let scores = [50, 60, 70, 80, 90];
// დაბეჭდე პირველი და ბოლო ქულა.
// მეორე ქულა შეცვალე 100-ით.
// მეოთხე ქულა შეცვალე 75-ით.
// დაბეჭდე განახლებული სია.

// 9)მოცემულია:
// let nums = [3, 6, 9, 12, 15];
// // გააორმაგე პირველი ელემენტი.
// // მესამე ელემენტს დაუმატე 5.
// // ბოლო ელემენტი შეცვალე 0-ით.
// // დაბეჭდე შედეგი.
// nums[0] = nums[0] * nums[0]
// nums[2] = nums[2] + 5
// nums[nums.length -1] = 0
// console.log(nums)

// 10)შექმენი ფუნქცია printFirst(arr), რომელიც მიიღებს სიას და დაბეჭდავს პირველ ელემენტს.
// მაგალითი:
// printFirst(["Apple", "Banana", "Orange"]);
// function printFirst(arr){
//     return arr[0]
// }

