// // 1)მოცემულია ორი სია:
// let arr1 = [1, 2, 3, 4];
// let arr2 = [3, 4, 5, 6];
// // დავალება: Nested loop-ის გამოყენებით დაბეჭდე მხოლოდ ის რიცხვები, რომლებიც ორივე სიაშია.
// for (let i = 0; i < arr1.length; i++){
//     for (let x = 0; x < arr2.length; x++){
//         if (arr1[i] === arr2[x]){
//             console.log(arr1[i])
//         }
//     }
// }


// 2)მოცემულია:
// let colors = ["Red", "Blue", "Green"];
// let sizes = ["S", "M", "L"];
// დავალება: დაბეჭდე ყველა შესაძლო კომბინაცია.



// 3)დუბლიკატების პოვნა
// მოცემულია:
// let numbers = [5, 2, 7, 5, 9, 2];
// დავალება: Nested loop-ის გამოყენებით იპოვე და დაბეჭდე დუბლირებული რიცხვები.



// 4)6) ერთნაირი სახელების პოვნა
// მოცემულია:
// let names = ["Nika", "Gio", "Ana", "Nika", "Ana"];
// დავალება: დაბეჭდე მხოლოდ ის სახელები, რომლებიც მეორდება.



// 5)ყველა მოსწავლისა და საგნის დაწყვილება
// მოცემულია:
// let students = ["Nika", "Ana", "Gio"];
// let subjects = ["Math", "English"];
// დავალება: დაბეჭდე ყველა შესაძლო წყვილი.



// 6)codeacademy მიიყვანეთ while loop ებამდე ყველამ