# 1)შექმენით სამი ცვლადი snake_case ის გამოყენებით მიანიჭეთ ამ ცვლადებსი სასურველი მნიშვნელობები და გამოიტანეთ ტერმინალში
# my_name="nika"
# user_name=input("emter your name: ")
# my_age=17
# print((my_name) +" "+ (user_name) +" "+ (str(my_age)))



# 2)კომენტარის სახით ახსენით რამდენი ცვლადია მოცემულ ფოტოში შექმნილი,დაწერეთ თქვენი პასუხი და ახსენით ასევე რატომ,ასევე შექმენით სამი ცვლადი იგივენაირად და ახსენით რასაც გააკეთებთ
#  კომენტარის სახით
# name="goga"
# name="giorgi"
# namE="lasha"
# NAME="zoia"
# მოცემულია 3 ცვლადი რადგან პაითონი არის ქეისენსიტიურ ენა ცვლადის სახელები შეიძლება იყოს ერთნაირი მაგრამ ზოგი დიდი ასოებით წერია ზოგი პატარებით

# ```3)კომენტარის სახით ახსენით რა არის კონკატინაცია და მოიყვანეთ მაგალითები```
# კონკატინაცია არის სტრინგების გაერთიანება მაგლიტად ასე
# print((name) +" "+ (user_name))

# 4)შექმენით ცვლადები სადაც შეინახავთ სახელს გვარს ასაკს სიმაღლეს და საცხოვრებელ ადგილს,თქვენი დავალება იქნება გამოიტანოთ ეს ყველაფერი ერთ გრძელ წინადადებად გამოიყენეთ ნასწავლი მასალა int()
#  str()... და კონკატენაცია
# name="nika"
# surname="asanashvili"
# age=17
# height=1.65
# living_plaeis="tbilisi"

# print("hi my name is" +" "+ (name) +" "+ "my surname is" +" "+ (surname) +""+ "i em" +" "+ str((age)) +" "+ "years olde" +" "+ "my height is" +" "+ str(height)
#        +" "+ "i live in" +" "+ (living_plaeis))

# 5)მომხმარებელს შემოატანინეთ ავტომობილის სახელი,ავტომობილის ფერი,ავტომობილის ფასი და ასევე შემოატანინეთ ავტომობილის გამოშვების თარიღი და შენინახეთ ეს ყველაფერი ცვლადებში,input ებთან 
# როგორც გასწავლეთ თ რიცხვი შემოაქვს მომხმარებელს გადააქციეთ ეს input ები ინტეჯერებად და ამის შემდეგ მოახდინეთ ამ ყველაფრის კონკატენაცია ანუ გამოიტანეთ მომხმარებლის მიერ შემოყვანილი 
# მნიშვნელობები ერთ გრძელ წინადადებად

# car=input("chosen car: ")
# car_color=input("car color: ")
# car_prise=int(input("car prise: "))
# print("sou you vant" +" "+ (car_color) +" "+ (car) +" "+ "end this car prise is" +" "+ str(car_prise))


# 6)შექმენით 4 ცვლადი,ერთიში შეინახეთ ინტეჯერი,მეორეში სტრინგი,მესამეში ფლოუტი და მეოთხეში ბულეანის მნიშვნელობა

# name="nika"
# age=17
# xurda=5.0


# 7)მომხმარებელს შემოატანინეთ საცხოვრებელი ადგილი და საყვარელი ცხოველი

# user_living_place=input("enter your living place: ")
# user_favorite_animal=input("enter your favorite animal: ")



# 8)შექმენით ცვლადი ამ ცვლადში შეინახეთ მნიშვნელობად ინტეჯერი და შემდეგ გადააქციეთ ეს ინტეჯერი სტრინგად(გამოიყენეთ შესაბამისი ფუნქცია,ბრჭყალებში არ ჩასვათ😁😆),ამის შემდეგ შექმენით 
# მეორე ცვლადი და მნიშვნელობად მიანიჭეთ რაიმე რიცხვი ოღნდ ეს რიცხვი იყოს სტრინგი,თქვენი მოვალეობაა გადააქციოთ ეს სტრინგი რიცხვი ინტეჯერად(აქაც გამოიყენეთ შესაბამისი ფუნქცია

# age=17
# print(str(age))

# my_age="10"
# print(int(my_age) + (age))


# 9)მომხმარებელს შემოატანინეთ ორი რიცხვი,თქვენი დავალებაა მოახდინოთ ყველა მათემატიკური ოპერაცია ამ რიცხვებზე, +,-./,//,*,==,%,ასევე კომენტარის სახით ახსენით რას აკეთებს % ნიშანი
# num1=int(input("number 1: "))
# num2=int(input("number 2:"))
# num3=int(input("number 3:",))
# print(num1 - num2 / num3)
# print(num1 / num2 % num3)
# print(num1 // num2 < num3)
# print(num1 % num2 > num3)
# print(num1 % num2 * num3)
# print(num1 * num2 // num3)
# print(num1 * num2 - num3)

# % ნაშთანი გაყოფა