// // 1)კომენტარის სახით ახსენით თუ რა ფუნქციები ვისწავლეთ მონაცემთა ტიპის შესაცვლელად ,ჩამოწერე ყველა მათგანი

// // 2) 
// // მომხმარებელს შემოატანინე მნიშვნელობა prompt-ით.
// // გააკეთე:

// // გადააქციე Number()-ით
// // გადააქციე parseInt()-ით
// // გადააქციე String()-ით
// // გამოიყენე toString() (თუ შესაძლებელია)
// let user1 =String(prompt("eneter txt: ")) 
// let num = Number(prompt("enter nmumber: "))
// let n1 = parseInt(prompt("enter tx: "))
// let n2 = toString(prompt('enter txt: '))

// // დაბეჭდე ყველმათი ტიპები 
// console.log(typeof(user1))
// console.log(typeof(num))
// console.log(typeof(n1))
// console.log(typeof(n2))

// 3)მომხმარებელს შემოატანინე ორი მნიშვნელობა,შენი დავალებაა რომ იპოვო ამ რიცხვების ჯამი

let umm1 = Number(prompt("enter number: ")) 
let num2 = Number(prompt("enter number: "))
console.log(num1 + num2)



// 4)მომხმარებელს შემოატანინე მნიშვნელობები შენს შესახებ --> სახელი გვარი ... და interpolation ით შექმენი წინადადება 

// 5)მომხმარებელს შემოატანინე რაიმე რიცხვი,შემდეგ გადააქციე ეს სტრინგი რიცხვი ნამბერად შესაბამისი მეთოდით და დაბეჭდე მისი ტიპი

// 6)მომხმარებელს შემოატანინე რაიმე ნამბერ ტიპის მონაცემი,შენი დავალებაა რომ გადააქციო ეს რიცხვი სტრინგად და დაბეჭდო მისი ტიპი

// 7)მომხმარებელს შემოატანინე 4 ნამბერ ტიპის მონაცემი,შენი დავალებაა რომ მოახდინო ამ რიცხვების კონკატინაცცია,გამოიყენე შესაბამისი მეთოდები

// 8)მომხმარებელს შემოატანინე ორი რიცხვი, შენი დავალებაა კონსოლში გამოიტანო რამდენია პირველი ამ ორი რიცხვის გაყოფისას მიღებული ნნაშთი(გამოიყენე შესაბამისი ფუნქცია და მათემატიკური ოპეტაროტი-->გადახედეთ გავლილს)

// 9)მომხმარებელს შემოატანინე ორი რიცხვი,შენი დაალებაა გაიგო ამ ორი რიცხვის ნამრავლი

// 10)მომხმარებელს შემოატანინე 5 რიცხვი,შენი დავალებაა გაიგო რამდენია ამ რიცხვების საშვალო არითმეტიკული(მოიძიეთ თუ არ იცით რა არის საშვალო არითმეტიკული)

// 11)შექმენი ცვლადი სადაც მომხმარებელი შემოტანს სტრინგს,შემდეგ დაბეჭდე მისი ტიპი

// შემდეგ შენი დავალებაა ეს ცვლადი განაახლო ახალი მომხმარებლის მიერ შემოყვანილო მნიშვნელობით რომელიც იქნება უკვე რიცხვი,შემდეგ დაბეჭდე მისი ტიპიც-

