// 1)მომხმარებელს შემოაყვანინეთ რაიმე რიცხვი
// შენი დავალებაა შეამოწმო ტერნარით --> თუ ეს რიცხვი არის ლუწი გამოიტანეთ --> 
// "even" სხვა შემთხვევაშ გამოიტანეთ "odd"




// 2)მომხმარებელს შემოატანინე რაიმე სტრინგი,შემდეგ შეამოწმე თ ამ სტრინგის სიგრძე
//  მეტია 5 ზე გამოიტანე --> "big string" სხ ვა შემთხვევაში "short string"


// 3) შექმენი ცვლადი სადაც შეინახავ რაიმე რიცხვს
// შემდეგ switch ის დახმარებით შეამოწმე
// თუ ცვლადში შენახული მნშვნელობა არის 1 --> დალოგე --> ორშაბათი
// თუ ცვლადში შენახული მნშვნელობა არის 2 --> დალოგე --> სამშაბათი
// თუ ცვლადში შენახული მნშვნელობა არის 3 --> დალოგე --> ოთხშაბათი
// თუ ცვლადში შენახული მნშვნელობა არის 4 --> დალოგე --> ხუთშაბათი
// თუ ცვლადში შენახული მნშვნელობა არის 5 --> დალოგე --> პარასკევი
// თუ ცვლადში შენახული მნშვნელობა არის 6 --> დალოგე --> შაბათი
// თუ ცვლადში შენახული მნშვნელობა არის 7 --> დალოგე --> კვირა
// სხვა შემთხვევაში დალოგე --> ასეთი კვირის დღე არ არსებობს
