
// TERNARY

// 1)prompt()-ით მიიღე ასაკი.
// თუ 18 ან მეტია, დაბეჭდე "შეგიძლია ხმის მიცემა", წინააღმდეგ შემთხვევაში "ჯერ ვერა".
let age = prompt("enter your age: ")

if (age > 18){
    console.log("shegidzlia xmis micema")
}
else{
    console.log("jer vera")
}

// 2)მომხმარებელს შეაყვანინე რიცხვი.
// Ternary-ით განსაზღვრე ლუწია თუ კენტი.

// 3)მომხმარებელს შეაყვანინე პაროლი.
// თუ მისი .length არის 8 ან მეტი, გამოიტანე "ძლიერი პაროლი", სხვა შემთხვევაში "სუსტი პაროლი".

let pass = prompt("enter pass: ")
if (pass.length > 8){
    console.log("dzlieri parolia")
}
else{
    console.log("susuti paroli")
}


// 4)მომხმარებელმა შეიძლება შეიყვანოს:
// "    admin    "
// trim() გამოიყენე და ternary-ით შეამოწმე, არის თუ არა "admin".


// 5)რიცხვის მიხედვით გამოიტანე:

// "დადებითი"
// "უარყოფითი"
// "ნულია"

// გამოიყენე მხოლოდ ternary.

// 6)ორი სახელი შეაყვანინე.
// თუ პირველის .length მეტია, გამოიტანე პირველი, წინააღმდეგ შემთხვევაში მეორე.

// 7)შეიყვანე ორი რიცხვი prompt()-ით.
// თუ პირველი მეტია მეორეზე, დაბეჭდე "პირველი დიდია", სხვა შემთხვევაში "მეორე ტოლია ან დიდია".

// 8)შექმენი ცვლადი:

// let data = "25";

// Ternary-ით შეამოწმე:
// თუ typeof data === "string" გამოიტანე "სტრინგია", სხვა შემთხვევაში "სტრინგი არაა".

// 9)მომხმარებლის როლი
// let role = prompt("შეიყვანე როლი").trim().toLowerCase();

// თუ role არის "admin" → "სრული წვდომა"

// თუ "moderator" → "შეზღუდული წვდომა"

// დანარჩენ შემთხვევაში → "მომხმარებელი"

// (გამოიყენე nested ternary.)

// 10)მომხმარებელი წერს ქულას (0-100).

// გამოიტანე:

// 90+ → "A"
// 80+ → "B"
// 70+ → "C"
// 60+ → "D"
// დანარჩენი → "F"

// მხოლოდ ternary-ებით.



// SWITCH

// 10)მომხმარებელი წერს თვის ნომერს (1-12).

// switch-ით განსაზღვრე სეზონი:

// 12, 1, 2 → ზამთარი
// 3, 4, 5 → გაზაფხული
// 6, 7, 8 → ზაფხული
// 9, 10, 11 → შემოდგომა

// 11)მომხმარებელი წერს ფერს:

// "red"
// "yellow"
// "green"

// switch-ით გამოიტანე:

// red → "გაჩერდი"
// yellow → "მოემზადე"
// green → "იარე"

// 12)შეიყვანე ცხოველის სახელი:

// dog
// cat
// cow
// sheep

// switch-ით გამოიტანე შესაბამისი ხმა.

// 13)მომხმარებელი წერს სიმბოლოს:

// A
// B
// C
// D
// F

// switch-ით გამოიტანე შესაბამისი ტექსტი:

// A → შესანიშნავი
// B → ძალიან კარგი
// C → კარგი
// D → დამაკმაყოფილებელი
// F → ჩაჭრილი

// 14)შეიყვანე ბრაუზერის სახელი:

// chrome
// firefox
// edge
// safari

// გამოიტანე მცირე აღწერა თითოეულზე.

// 15)შეიყვანე:

// admin
// moderator
// user
// guest

// გამოიტანე მათი უფლებები.

// 16) შეასრულე codacademy conditionlals ბოლომდე